title: Potential Credential Dumping
id: 41db86ef-credential-dumping-threat-hunting-lab
status: experimental
description: Detects suspicious access or command lines related to LSASS dumping.
author: Ashaar Leacock-Thomas
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains:
      - 'lsass'
      - 'procdump'
      - 'sekurlsa'
      - 'mimikatz'
  condition: selection
level: critical
tags:
  - attack.credential_access
  - attack.t1003
