title: PowerShell Encoded Command
id: 2d6e29fc-encoded-command-threat-hunting-lab
status: experimental
description: Detects PowerShell encoded commands.
author: Ashaar Leacock-Thomas
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains:
      - '-EncodedCommand'
      - '-enc'
      - '-e '
  condition: selection
level: high
tags:
  - attack.execution
  - attack.t1059.001
